# RenderRpcFilename Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RenderRpcFilename Property
ParameterTypeId Class See Also
---
"Render Appearance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RenderRpcFilename { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RenderRpcFilename As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RenderRpcFilename {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace